Tawank/BruceOS/boards/lilygo-t-embed/sdkconfig.defaults
# LilyGO T-Embed (ESP32-S3, ST7789 170x320 round-corner bar display, no CC1101 radio).
#
# Do not confuse this with boards/lilygo-t-embed-cc1101 - it's a different
# physical board with entirely different pin numbers, not just a variant
# missing the radio. (The legacy PlatformIO tree shares one pins_arduino.h
# file between the two, gated on `#ifdef T_EMBED_1101`; this file was
# translated from that same file's `#else` branch, i.e. plain T_EMBED.)
#
# Peripherals with no equivalent in this HAL yet (W5500 ethernet, PN532 NFC,
# PDM mic, RGB LED, BadUSB, FM radio) are not ported. IR and NRF24 are also
# not wired here even though the legacy code default-enables IR: on this
# board those, the board I2C bus, and the optional CC1101 add-on all
# time-share the same two expansion-header GPIOs (43/44) depending on what's
# plugged in, which this HAL's static one-purpose-per-pin config can't
# express - see the help text below.
#
# Selected via `python tools/board.py lilygo-t-embed build` (see
# tools/board.py), which passes this file through SDKCONFIG_DEFAULTS after
# the shared sdkconfig.defaults. The build system automatically also loads
# sdkconfig.defaults.esp32s3 if present, per ESP-IDF's target-dependent
# sdkconfig defaults rule.
CONFIG_IDF_TARGET="esp32s3"

# PSRAM: this board's ESP32-S3 module has 8MB of in-package Octal PSRAM
# (legacy board_build.arduino.memory_type = qio_opi - "opi" is Octal PSRAM,
# distinct from the Quad-PSRAM "qspi" some other boards use, e.g.
# lilygo-t-lora-pager's qio_qspi). 80MHz is the standard, non-experimental
# speed for Octal PSRAM on ESP32-S3 (120MHz is flagged experimental/
# thermal-sensitive in Kconfig.spiram; 40MHz leaves it underused). CLK/CS
# IO default to the fixed internal pins the R8 in-package PSRAM actually
# uses, not GPIOs, so nothing else needs configuring here.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# Route plain malloc() (not just explicit MALLOC_CAP_SPIRAM callers like
# memory__external_alloc() below) through PSRAM once it no longer fits
# internal RAM. This is already ESP-IDF's own default SPIRAM_USE choice
# once CONFIG_SPIRAM=y - pinned explicitly here so it can't silently change
# out from under this board if that upstream default ever does.
CONFIG_SPIRAM_USE_MALLOC=y
# SPIRAM_MALLOC_ALWAYSINTERNAL (esp_psram/Kconfig.spiram.common) is a
# *preference* threshold, not a hard split: plain malloc() below this size
# prefers internal RAM (falling back to PSRAM if internal is full), and
# above it prefers PSRAM (falling back to internal if PSRAM is full).
# BRUCE_MEMORY_FORCE_PSRAM below already routes memory__malloc() around
# this entirely, but this still governs every allocation this board makes
# through plain malloc()/calloc() directly - most notably mbedTLS once
# MBEDTLS_DEFAULT_MEM_ALLOC is on (see below), whose TLS in/out buffers
# regularly land in the 5-16KB range and, at the 16KB default, would still
# prefer this board's scarce internal RAM. Lowered to 5KB so only truly
# small/hot allocations stay internal by preference; everything from 5KB up
# prefers PSRAM instead.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=5120

# ESP32-S3's I/D-cache Kconfig choice is a false economy at its default: the
# "32KB data cache" and "16KB data cache" options both configure the same
# physical 32KB of cache hardware (see Kconfig.cache's own comment) - "16KB"
# just donates the other 16KB to the heap instead of leaving it as cache.
# boards/m5stack-cardputer already opts into this; this board didn't, which
# left it with 16KB less internal RAM than necessary. That 16KB matters more
# here than almost anywhere else: FreeRTOS task stacks (see BROWSER_STACK_BYTES
# in main.c) are allocated via xTaskCreate(), which - unlike plain malloc() -
# always pulls from internal RAM with no PSRAM fallback, so every KB of
# internal headroom directly affects which apps can even launch.
CONFIG_ESP32S3_INSTRUCTION_CACHE_16KB=y
CONFIG_ESP32S3_DATA_CACHE_16KB=y

# ESP-IDF's default Wi-Fi buffer pools (32 dynamic RX + 32 dynamic TX
# buffers) are sized for routing/high-throughput use, not this device's
# interactive shell/app traffic. On measured hardware, associating to a WPA2
# AP dropped this board's largest free internal block from ~31KB (fresh
# boot) to ~10.5KB - below the 16KB a task like the browser app needs for
# its stack (see BROWSER_STACK_BYTES in main.c, and the note on
# CONFIG_SPIRAM_USE_MALLOC above for why task stacks can't fall back to
# PSRAM the way most other allocations do). boards/m5stack-cardputer
# already carries this same trim for the same reason - mirrored here.
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=12
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=12
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
# CONFIG_ESP_WIFI_STATIC_RX_MGMT_BUFFER is not set
CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUFFER=y
CONFIG_ESP_WIFI_RX_MGMT_BUF_NUM_DEF=5

# mbedTLS
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# boards/m5stack-cardputer already carries these two mbedTLS trims (it has no
# PSRAM at all, so it needs every internal KB back); this board never picked
# them up even though its own internal headroom turns out to be just as
# tight once Wi-Fi + the browser's own state are both live:
# - DYNAMIC_FREE_* releases the peer certificate, CA cert, and SSL config
#   data as soon as the handshake no longer needs them, instead of holding
#   each (often multiple KB for a real cert chain) for the connection's
#   whole lifetime.
# - The shared sdkconfig.defaults only trims SSL_IN_CONTENT_LEN (the
#   incoming/download side); the outgoing side was left at Kconfig's 4096B
#   default, far more than an HTTP request's headers need. 512B (matching
#   Cardputer) gives back 3.5KB per connection at no real cost.
CONFIG_MBEDTLS_DYNAMIC_FREE_PEER_CERT=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=y
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=512

# All the fixes above only narrow how much of the app layer's own general
# heap traffic (memory__malloc() and friends, core/memory/memory.c) spills
# into internal RAM instead of avoiding it outright - plain malloc()'s
# prefer-internal/fall-back-to-PSRAM policy (CONFIG_SPIRAM_MALLOC_
# ALWAYSINTERNAL above) still keeps every small allocation internal. With
# 8MB of PSRAM sitting mostly idle and internal RAM the one truly scarce
# resource here, pin that entire traffic class to PSRAM instead - see
# BRUCE_MEMORY_FORCE_PSRAM's help text for what this does and does not
# cover (task stacks and DMA buffers are unaffected either way) and its one
# real cost (PSRAM's higher access latency).
CONFIG_BRUCE_MEMORY_FORCE_PSRAM=y

# Partition layout: with PSRAM now available, memory__external_alloc()
# (src/core_sdk/memory.h) prefers PSRAM over the flash-backed "swap"
# partition, so swap's 512K is mostly wasted space here - use the swap-less
# layout instead. memory__external_alloc() still falls back straight to
# internal RAM if a PSRAM allocation doesn't fit and there's no swap
# partition to fall back to next, per that function's documented order.
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Power: GPIO46 must be driven high at boot to latch the board's peripheral
# power rail on (legacy PIN_POWER_ON, set HIGH in interface.cpp before
# anything else, unconditionally for this board too - only the pin number
# differs from the CC1101 variant's GPIO15). Left low/floating, the
# ESP32-S3 itself still boots fine off USB but the display and SD card stay
# unpowered - see BRUCE_POWER_HOLD_GPIO's help text.
CONFIG_BRUCE_POWER_HOLD_GPIO=46

# Board I2C bus (legacy GROVE_SDA/GROVE_SCL, aka SYS_I2C_SDA/SYS_I2C_SCL):
# left disabled here because these same two GPIOs (43/44) are also the
# legacy default IR TX/RX pins and the NRF24/CC1101 add-on's CS/CE pins on
# this board's shared expansion header - wiring it up by default would
# silently contend with whichever of those a future patch ports next.
# Uncomment if you need the QWIIC header as a plain I2C bus and aren't using
# the header for IR/NRF24/CC1101:
# CONFIG_BRUCE_BOARD_I2C_ENABLED=y
# CONFIG_BRUCE_BOARD_I2C_SDA_GPIO=44
# CONFIG_BRUCE_BOARD_I2C_SCL_GPIO=43

# Display: SPI2_HOST, ST7789 170x320 physical panel, portrait (rotation 3).
# Same physical panel as the CC1101 variant (see that board's sdkconfig.
# defaults for the gap-table provenance), but on its own dedicated SPI bus
# here (no MISO wired) rather than sharing one with SD/NRF24.
CONFIG_BRUCE_DISPLAY_WIDTH=170
CONFIG_BRUCE_DISPLAY_HEIGHT=320
CONFIG_BRUCE_DISPLAY_DEFAULT_ROTATION=3
CONFIG_BRUCE_DISPLAY_SPI_HOST=1
CONFIG_BRUCE_DISPLAY_PIN_MOSI=11
CONFIG_BRUCE_DISPLAY_PIN_SCK=12
CONFIG_BRUCE_DISPLAY_PIN_CS=10
CONFIG_BRUCE_DISPLAY_PIN_DC=13
CONFIG_BRUCE_DISPLAY_PIN_RST=9
CONFIG_BRUCE_DISPLAY_PIN_BL=15
# This board's backlight boost converter flickers near a full PWM duty cycle.
# Cap the UI's nominal 100% level at about 90% to leave enough off-time for
# the converter to stay in regulation.
CONFIG_BRUCE_DISPLAY_BACKLIGHT_MAX_LEVEL=220
CONFIG_BRUCE_DISPLAY_GAP_X_ROTATION0=35
CONFIG_BRUCE_DISPLAY_GAP_Y_ROTATION0=0
CONFIG_BRUCE_DISPLAY_GAP_X_ROTATION1=0
CONFIG_BRUCE_DISPLAY_GAP_Y_ROTATION1=35
CONFIG_BRUCE_DISPLAY_GAP_X_ROTATION2=35
CONFIG_BRUCE_DISPLAY_GAP_Y_ROTATION2=0
CONFIG_BRUCE_DISPLAY_GAP_X_ROTATION3=0
CONFIG_BRUCE_DISPLAY_GAP_Y_ROTATION3=35

# Audio: I2S DAC (NS4168 amp).
CONFIG_BRUCE_AUDIO_BACKEND_I2S=y
CONFIG_BRUCE_AUDIO_I2S_BCLK_GPIO=7
CONFIG_BRUCE_AUDIO_I2S_DATA_GPIO=6
CONFIG_BRUCE_AUDIO_I2S_LRCLK_GPIO=5

# Battery: no fuel-gauge/PMIC IC on this variant (unlike the CC1101 board's
# BQ27220) - legacy ANALOG_BAT_PIN 4 reads a raw divider on ADC1, which on
# ESP32-S3 is GPIO4 = ADC1 channel 3.
CONFIG_BRUCE_BATTERY_ENABLED=y
CONFIG_BRUCE_BATTERY_BACKEND_ADC=y
CONFIG_BRUCE_BATTERY_ADC_CHANNEL=3

# SD card: own SPI3_HOST bus, shared with nothing else on this variant
# (legacy SPI_MOSI_PIN/MISO_PIN/SCK_PIN/SDCARD_CS).
CONFIG_BRUCE_SD_ENABLED=y
CONFIG_BRUCE_SD_SPI_HOST=2
CONFIG_BRUCE_SD_PIN_MOSI=41
CONFIG_BRUCE_SD_PIN_MISO=38
CONFIG_BRUCE_SD_PIN_SCK=40
CONFIG_BRUCE_SD_PIN_CS=39

# Buttons: this board's only physical input besides the encoder's own turn
# motion is the encoder's center press (legacy ENCODER_KEY/SEL_BTN), mapped
# to SELECT (OK/confirm) - unlike the CC1101 variant there is no separate
# back button (no legacy BK_BTN on this board), so no button A here.
CONFIG_BRUCE_BUTTON_SELECT_ENABLED=y
CONFIG_BRUCE_BUTTON_SELECT_GPIO=0
# CONFIG_BRUCE_BUTTON_A_ENABLED is not set
# CONFIG_BRUCE_BUTTON_B_ENABLED is not set
# CONFIG_BRUCE_BUTTON_C_ENABLED is not set

# No GPIO matrix keyboard on this board.
# CONFIG_BRUCE_KEYBOARD_ENABLED is not set

# Rotary encoder: quadrature turn (legacy ENCODER_INA/INB), synthesized as
# PREV/NEXT presses (see BRUCE_ENCODER_ENABLED's help text) - works with
# every existing menu, including horizontal carousels (e.g. the system
# menu) that only handle PREV/NEXT/LEFT/RIGHT, not just the up/down ones.
# The center-press part is the SELECT button above, not here.
CONFIG_BRUCE_ENCODER_ENABLED=y
CONFIG_BRUCE_ENCODER_PIN_A=2
CONFIG_BRUCE_ENCODER_PIN_B=1
# This encoder is 2 quadrature sub-steps per detent, not the usual 4 - the
# legacy Arduino driver used RotaryDecoder's stepsPerDetent=2 default here
# (see BRUCE_ENCODER_STEPS_PER_DETENT's help text).
CONFIG_BRUCE_ENCODER_STEPS_PER_DETENT=2
# input_encoder.c decodes quadrature by polling the A/B pins on the shared
# input task tick rather than by GPIO interrupt, so a transition that
# happens between two polls is silently missed (not miscounted - the
# gray-code table just treats the skipped state as a no-op). With only 2
# sub-steps per detent, a fast flick of the knob can easily produce both
# transitions of a detent inside one 20ms (the default
# BRUCE_INPUT_POLL_PERIOD_MS) window, or straddle two windows badly enough
# to drop one - the faster you spin it, the more detents get eaten before
# they ever become a NEXT/PREV event, which is why scrolling fast feels
# like it lags behind the knob while scrolling slowly tracks it exactly.
# Polling every 5ms instead (the lowest BRUCE_INPUT_POLL_PERIOD_MS allows)
# gives quadrature decoding a much finer sampling rate for the cost of a
# few extra cheap GPIO reads/sec; it does not affect button debounce, which
# is timed off wall-clock ms, not poll ticks.
CONFIG_BRUCE_INPUT_POLL_PERIOD_MS=5
